app/controllers/api/portfolio_controller.rb

SELECT "portfolios".* FROM "portfolios"
---
  def index
    @portfolios = Portfolio.all

INSERT INTO "portfolios" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "hello"], ["created_at", "2017-12-27 15:28:40.238038"], ["updated_at", "2017-12-27 15:28:40.238038"]]
---
  def create
    @portfolio = Portfolio.create(portfolio_params)

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "portfolios" SET "cash_balance" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["cash_balance", nil], ["updated_at", "2017-12-26 19:32:49.176035"], ["id", 1]]
---
  def update
    @portfolio = Portfolio.find(params[:id])

    @portfolio.update(portfolio_params)