app/controllers/api/stockportfolios_controller.rb

INSERT INTO "stockportfolios" ("portfolio_id", "created_at", "updated_at", "quantity", "ticker") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["portfolio_id", 2], ["created_at", "2017-12-26 00:58:43.160423"], ["updated_at", "2017-12-26 00:58:43.160423"], ["quantity", 7], ["ticker", "wdc"]]
---
  def create
    @stockportfolio = Stockportfolio.create(stockportfolio_params)

SELECT  "stockportfolios".* FROM "stockportfolios" WHERE "stockportfolios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "stockportfolios" WHERE "stockportfolios"."id" = $1  [["id", 5]]
---
  def destroy
    @stockportfolio = Stockportfolio.find(params[:id])
    @stockportfolio.destroy