app/controllers/api/stocks_controller.rb

  def index
    @stocks = Stock.all
---
SELECT "stocks".* FROM "stocks"